Actions/Window/net-kogics-kojo-CodeEditorAction.instance=CodeEditor
Actions/Window/net-kogics-kojo-HistoryAction.instance=History
Actions/Window/net-kogics-kojo-SCanvasAction.instance=SCanvas
CTL_CodeEditorAction=Redigeraren (Script &Editor)
CTL_CodeEditorTopComponent=Redigeraren (Script Editor)
CTL_GeoGebraAction=&Mattev\u00e4rlden (Math World)
CTL_GeoGebraTopComponent=Mattev\u00e4rlden (Math World)
CTL_HistoryAction=&Historik (History)
CTL_HistoryTopComponent=Historik (History)
CTL_LoadFrom=\u00d6ppna... (Open...)
CTL_OutputAction=Utdata (&Output)
CTL_OutputTopComponent=Utdataf\u00f6nster (Output Pane)
CTL_Save=Spara...(Save...)
CTL_SaveAs=Spara som...(Save As...)
CTL_SCanvasAction=Ritf\u00f6nster (&Drawing Canvas)
CTL_SCanvasTopComponent=Ritf\u00f6nster (Drawing Canvas)
HINT_CodeEditorTopComponent=Detta \u00e4r Skriptredigeraref\u00f6nstret(This is the Script Editor window)
HINT_GeoGebraTopComponent=Detta \u00e4r Mattev\u00e4rldenf\u00f6nstret (This is the Math World window)
HINT_HistoryTopComponent=Detta \u00e4r Historikf\u00f6nstret (This is the History window)
HINT_OutputTopComponent=Detta \u00e4r Utdataf\u00f6nstret (This is the Output window)
HINT_SCanvasTopComponent=Detta \u00e4r Ritf\u00f6nstret (This is the Drawing window)
OpenIDE-Module-Name=KojoEnv

CTL_Find=S\u00f6k i skript (Find in Script)
CTL_Replace=Ers\u00e4tt i skript (Replace in Script)

S_TurtleMode=V\u00e4xla till sk\u00f6ldpaddsl\u00e4ge (Switch to Turtle Mode)
S_TurtleModeTT=Aktiverar standardkommandon, sk\u00f6ldpaddskommandon och kodkomplettering. G\u00f6mmer sceneri och mattev\u00e4rlden (Activates Default/Turtle commands and code-completions, and hides Staging and MathWorld commands and code-completions)
S_StagingMode=V\u00e4xla till sceneri-l\u00e4ge (Switch to Staging Mode)
S_StagingModeTT=Aktiverar sceneri-kommandon och kodkomplettering. G\u00f6mmer sk\u00f6ldpadds- och mattev\u00e4rlden-kommandon samt kodkomplettering. (Activates Staging commands and code-completions, and hides Turtle and MathWorld commands and code-completions)
S_MwMode=V\u00e4xla till mattev\u00e4rlden-l\u00e4ge (Switch to MathWorld Mode)
S_MwModeTT=Aktiverar mattev\u00e4rlden-kommandon och kodkomplettering. G\u00f6mmer sk\u00f6ldpadds- och mattev\u00e4rlden-kommandon samt kodkomplettering.(Activates MathWorld commands and code-completions, and hides Turtle and Staging commands and code-completions)
S_Edit=Redigera (Edit)
S_Source=K\u00e4lla (Source)
S_ClearEditor=Sudda redigeraren och st\u00e4ng filen (Clear Editor and Close File)
S_AdvancedOptions=Avancerade inst\u00e4llningar (Advanced Options...)
S_Expt=Experimentella funktioner! (Experimental Features!)

S_ShowAxes=Visa axlar (Show Axes)
S_ShowGrid=Visa rutn\u00e4t (Show Grid)
S_ShowProtractor=Show Protractor
S_SaveAsImage=Save as Image
S_ResetPanZoom=Nollst\u00e4ll panorering och zoom (Reset Pan and Zoom)
S_Clear=Sudda (Clear)
S_MouseActions=Musr\u00f6relser: Dra f\u00f6r att panorera, skift-dra f\u00f6r att zooma (Mouse Actions: Drag to Pan; Shift-Drag to Zoom)

S_RunScript=K\u00f6r (Run Script) (Ctrl + Enter)
S_CheckScript=Kolla efter fel (Check Script for Errors) (helps to precisely locate errors)
S_StopScript=Stoppa (Stop Script/Animation)
S_HistNext=N\u00e4sta (Go to Next Script in History) (Ctrl + Down Arrow)
S_HistPrev=F\u00f6reg\u00e5ende (Goto Previous Script in History) (Ctrl + Up Arrow)
S_ClearEditorT=Sudda och st\u00e4ng filen (Clear Editor and Close Open File) (Ctrl + L)
S_ClearOutput=Sudda utdataf\u00f6nstret (Clear Output Pane)
S_Upload=Ladda upp kod (Upload to the CodeExchange at www.kogics.net)
S_FileChanged=Du har gjort \u00e4ndringar sedan filen %s laddades!\
Vill du skriva \u00f6ver %s med inneh\u00e5llet i Redigeraren?\
You have made changes since you opened the file %s!\
Do you want to overwrite %s with the current contents of the Script Editor?
S_FileExists=Filen %s finns redan. Vill du skriva \u00f6ver den? (%s already exists. Do you want to overwrite it?)
